# Деректер базасына (PostgreSQL) қосылу үшін қажетті баптаулар
# Настройки для подключения к базе данных PostgreSQL
DB_CONFIG = {
    "host": "localhost",       # Хост (сервер) мекенжайы / Адрес сервера базы данных
    "dbname": "phonebook_db",  # Деректер базасының атауы / Имя базы данных
    "user": "postgres",        # Пайдаланушы аты / Имя пользователя СУБД
    "password": "1234",        # Құпия сөз / Пароль пользователя
    "port": 5432               # Қосылу порты (PostgreSQL үшін стандартты порт 5432) / Стандартный порт PostgreSQL
}
